# Отчёт cat — вывод всех записей

Отчёт выводит все записи, прочитанные из входных файлов, на stdout в формате, совпадающем с [родным форматом](Syntax) YaLedger. Отчёт может быть использован для конвертирования журналов транзакций поддерживаемых форматов ([CSV](CSV), [HTML](HTML)) в родной формат YaLedger.

## Опции

Одна опция `-C`, `--csv`. Если указано, то выводятся только записи о проводках, в формате CSV.

## Примеры вызова

Вывод всех записей в родном формате:

    $ yaledger cat
    [...]

    @ 2012/09/23, 12:00:00 
      cr X1  40.00€
      Z5

    @ 2012/09/23, 15:00:00 
      cr X1  2.00€

    @ 2012/10/07 
      cr roubles  0.20р
      Z5

    @ 2012/11/30 (test) 
    hold  dr карточка  1000.00р

    @ 2012/12/01 
    hold  cr трамвай  50.00р
    hold  dr карман  50.00р

    @ 2012/12/02 
    close   dr карман  50.00р

    @ 2012/12/10 
    use cr трамвай  30.00р
      карман

    @ 2012/12/11 
    close   cr трамвай  20.00р

    @ 2012/12/12 
    hold  dr карман  25.00р

    @ 2012/12/13 
      cr банковское_обслуживание  15.00р
      карточка

    @ 2012/12/14 
    close <=   dr карточка  2000.00р

Вывод проводок в CSV:

    $ yaledger cat -C
    DATE;"CREDIT ACCOUNT";"CREDIT AMOUNT";"DEBIT ACCOUNT";"DEBIT AMOUNT"
    2012/09/09;Root/X/X1;100.00$;;
    2012/09/09;;;Root/Y/Y1;50.00$
    2012/09/11;Root/X/X1;3.00р;;
    2012/09/12;;;Root/движение/доходы/зарплата;6400.00р
    2012/09/13;Root/roubles;2.00р;;
    2012/09/16;Root/X/X2;3.00$;;
    2012/09/16;Root/X/X1;2.00$;;
    2012/09/17;Root/X/X1;3.00€;;
    2012/09/18;Root/активы/карман;100.00р;;
    2012/09/19;Root/Z/Z5;100.00$;;
    2012/09/20;;;Root/Z/Z5;50.00$
    2012/09/21;;;Root/Z/Z5;30.00$
    2012/09/22;Root/Z/Z6;10.00$;;
    "2012/09/23, 10:00:00";Root/X/X1;40.00$;;
    "2012/09/23, 12:00:00";Root/X/X1;40.00€;;
    "2012/09/23, 15:00:00";Root/X/X1;2.00€;;
    2012/10/07;Root/roubles;0.20р;;
    2012/12/10;Root/движение/расходы/трамвай;30.00р;;
    2012/12/13;Root/движение/расходы/банковское_обслуживание;15.00р;;

