# YaLedger

YaLedger разрабатывается как «полновесное», full-featured приложение для
«домашней бухгалтерии» в стиле ledger / hledger. В отличие от них,
yaledger использует полновесную схему бухучёта, основанную на
транзакциях, проводках и полупроводках. Это позволяет реализовать
возможности, характерные для коммерческих бухгалтерских программ.

Описания версий: [0.1.0.0](README), [0.1.1.0](0110), [0.1.2.0](0120),
[0.1.3.0](0130)

-   [Общее описание](README)
-   [Установка](INSTALL)
-   [Используемые принципы бухгалтерского учёта](Accounting)
-   [Общий алгоритм работы](Algo)
-   [Параметры командной строки](CmdLine)
-   [Форматы входных файлов](Files):
    -   [Глобальный конфигурационный файл](Config)
    -   [Файл описания валют](Currencies)
    -   [План счетов](Accounts)
    -   [Карта счетов](AccountsMap)
    -   [«Родной» формат журнала транзакций](Syntax)
    -   [«Табличные» форматы](Tables):
        -   [CSV](CSV)
        -   [HTML](HTML)

    -   [Загрузка курсов валют ЦБ РФ](CBRRates)

-   Возможности YaLedger:
    -   [Атрибуты счетов и транзакций](Attributes)
    -   [Автоматический поиск корреспондирующего счёта](Correspondence)
    -   [Сверка балансов счетов](Reconciliation)
    -   [Шаблоны транзакций](Templates)
    -   [Периодические транзакции](Periodic)
    -   [Автоматическое создание транзакций по правилам](Rules)
    -   [Определение дублированных транзакций](Deduplication)
    -   [Поддержка резервов счетов](Holds)
    -   [Проверка балансов счетов](BalanceChecks)
    -   [Автоматическое перенаправление части дебета](DebitRedirect)

-   [Отчёты](Reports):
    -   [Balances](Balances)
    -   [Saldo](Saldo)
    -   [Registry](Registry)
    -   [Postings](Postings)
    -   [Details](Details)
    -   [IncomeStatement](IncomeStatement)
    -   [turnovers](Turnovers)
    -   [holds](HoldsReport)
    -   [stats](StatsReport)
    -   [flow](FlowReport)
    -   [accounts](AccountsReport)
    -   [cat](Cat)

-   Приложения:
    -   [Возможные варианты учёта транзакций по банковским картам с использованием банковских выписок по карте](CardExamples)
    -   [Возможные варианты управления будущими тратами](FutureExpenses)
    -   [Графики](Charts)
